controllers/SiteController.php

    public function actionIndex()
	{
		$query = Interests::find();

		$pagination = new Pagination([
			'defaultPageSize' => 5,
            'totalCount' => $query->count()
		]);

		$interests = $query->orderBy('interest_id')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `interests`
SELECT * FROM `interests` ORDER BY `interest_id` LIMIT 5 OFFSET 5

	public function actionNew()
	{
		$query = Instruments::find();

		$instruments = $query->all();
---
SELECT * FROM `instruments`

	public function actionEdit()
	{
		$query = Interests::findOne($this->request->queryParams['id']);

		$dropdownQuery = Instruments::find();
		$instruments = $dropdownQuery->all();
---
SELECT * FROM `interests` WHERE `interest_id`='11'
SELECT * FROM `instruments`

	public function actionDelete()
	{
		$model = Interests::findOne($this->request->queryParams['id']);
---
SELECT * FROM `interests` WHERE `interest_id`='9'

	public function actionApprove()
	{
		$model = Interests::findOne($this->request->queryParams['id']);
---
SELECT * FROM `interests` WHERE `interest_id`='10'

	public function actionCancel()
	{
		$model = Interests::findOne($this->request->queryParams['id']);
---
SELECT * FROM `interests` WHERE `interest_id`='8'