models/Interests.php

INSERT INTO `interests` (`ins_code`, `interest_rate`, `payment_date`, `status_id`, `record_date`) VALUES ('CLASSIC_REPO', 12, '2023-04-26', 1, '2023-04-20 01:51:48')
UPDATE `interests` SET `interest_rate`=34, `payment_date`='2022-11-17', `record_date`='2023-04-20 02:03:20' WHERE `interest_id`=11
---
	public function new()
    {
		$this->status_id = 1;
		$this->record_date = date("Y-m-d H:i:s");
		$this->save();

DELETE FROM `interests` WHERE `interest_id`=9
---
	public function remove()
    {
		$this->delete();

UPDATE `interests` SET `status_id`=2 WHERE `interest_id`=10
---
	public function approve()
    {
		$this->status_id = 2;
		$this->save();

UPDATE `interests` SET `status_id`=3 WHERE `interest_id`=8
---
	public function cancel()
    {
		$this->status_id = 3;
		$this->save();